ArteryTek/platform-arterytekat32/misc/svd/AT32F422xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <description>Comparator</description>
      <groupName>CMP</groupName>
      <baseAddress>0x4001001C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3E4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLSTS</name>
          <displayName>CTRLSTS</displayName>
          <description>CMP control/status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>Comparator enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPIS</name>
              <description>Comparator input shift</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPSSEL</name>
              <description>Comparator speed selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPINVSEL</name>
              <description>Comparator inverting selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPNINVSEL</name>
              <description>Comparator non-inverting input selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPTAG</name>
              <description>Comparator output target</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPP</name>
              <description>Comparator polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPHYST</name>
              <description>Comparator hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPBLANKING</name>
              <description>Comparator blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>BRGEN</name>
              <description>Comparator brgen</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>SCALEN</name>
              <description>Comparator scalen</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>CMPVALUE</name>
              <description>Comparator output value</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>CMPWP</name>
              <description>Comparator write protect</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>G_FILTER_EN</name>
          <displayName>G_FILTER_EN</displayName>
          <description>G_FILTER_EN</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>GFE</name>
              <description>Glitch filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH_PULSE</name>
          <displayName>HIGH_PULSE</displayName>
          <description>HIGH_PULSE</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>H_PULSE_CNT</name>
              <description>High pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>LOW_PULSE</name>
          <displayName>LOW_PULSE</displayName>
          <description>LOW_PULSE</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>L_PULSE_CNT</name>
              <description>Low pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DEBUG</name>
      <description>Debug support</description>
      <groupName>DEBUG</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>DEBUG_IDCODE</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>PID</name>
              <description>PID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>DEBUG_CTRL</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SLEEP_DEBUG</name>
              <description>SLEEP_DEBUG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEEPSLEEP_DEBUG</name>
              <description>DEEPSLEEP_DEBUG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STANDBY_DEBUG</name>
              <description>STANDBY_DEBUG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT_PAUSE</name>
              <description>WDT_PAUSE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDT_PAUSE</name>
              <description>WWDT_PAUSE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR1_PAUSE</name>
              <description>TMR1_PAUSE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR3_PAUSE</name>
              <description>TMR3_PAUSE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERTC_PAUSE</name>
              <description>ERTC_PAUSE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_SMBUS_TIMEOUT</name>
              <description>I2C1_SMBUS_TIMEOUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_SMBUS_TIMEOUT</name>
              <description>I2C2_SMBUS_TIMEOUT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR6_PAUSE</name>
              <description>TMR6_PAUSE</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERTC_512_PAUSE</name>
              <description>ERTC_512_PAUSE</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR15_PAUSE</name>
              <description>TMR15_PAUSE</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR16_PAUSE</name>
              <description>TMR16_PAUSE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR17_PAUSE</name>
              <description>TMR17_PAUSE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR4_PAUSE</name>
              <description>TMR4_PAUSE</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>SER_ID</name>
          <displayName>SER_ID</displayName>
          <description>SERIES ID</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SER_ID</name>
              <description>series ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
