ArteryTek/platform-arterytekat32/misc/svd/AT32F422xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FPU</name>
      <description>Floting point unit</description>
      <groupName>FPU</groupName>
      <baseAddress>0xE000EF34</baseAddress>
      <addressBlock>
         <offset>0x0</offset>
         <size>0xD</size>
         <usage>registers</usage>
      </addressBlock>
      <interrupt>
         <name>FPU</name>
         <description>Floating point unit interrupt</description>
         <value>37</value>
      </interrupt>
      <registers>
         <register>
            <name>FPCCR</name>
            <displayName>FPCCR</displayName>
            <description>Floating-point context control register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
               <field>
                  <name>LSPACT</name>
                  <description>LSPACT</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>USER</name>
                  <description>USER</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>THREAD</name>
                  <description>THREAD</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>HFRDY</name>
                  <description>HFRDY</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>MMRDY</name>
                  <description>MMRDY</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>BFRDY</name>
                  <description>BFRDY</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>MONRDY</name>
                  <description>MONRDY</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>LSPEN</name>
                  <description>LSPEN</description>
                  <bitOffset>30</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>ASPEN</name>
                  <description>ASPEN</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
            </fields>
         </register>
         <register>
            <name>FPCAR</name>
            <displayName>FPCAR</displayName>
            <description>Floating-point context address register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
               <field>
                  <name>ADDRESS</name>
                  <description>Location of unpopulated floating-point</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>29</bitWidth>
               </field>
            </fields>
         </register>
         <register>
            <name>FPSCR</name>
            <displayName>FPSCR</displayName>
            <description>Floating-point status control register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
               <field>
                  <name>IOC</name>
                  <description>Invalid operation cumulative exception bit</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>DZC</name>
                  <description>Division by zero cumulative exception bit.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>OFC</name>
                  <description>Overflow cumulative exception bit</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>UFC</name>
                  <description>Underflow cumulative exception bit</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>IXC</name>
                  <description>Inexact cumulative exception bit</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>IDC</name>
                  <description>Input denormal cumulative exception bit.</description>
                  <bitOffset>7</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>RMode</name>
                  <description>Rounding Mode control field</description>
                  <bitOffset>22</bitOffset>
                  <bitWidth>2</bitWidth>
               </field>
               <field>
                  <name>FZ</name>
                  <description>Flush-to-zero mode control bit:</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>DN</name>
                  <description>Default NaN mode control bit</description>
                  <bitOffset>25</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>AHP</name>
                  <description>Alternative half-precision control bit</description>
                  <bitOffset>26</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>V</name>
                  <description>Overflow condition code flag</description>
                  <bitOffset>28</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>C</name>
                  <description>Carry condition code flag</description>
                  <bitOffset>29</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>Z</name>
                  <description>Zero condition code flag</description>
                  <bitOffset>30</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
               <field>
                  <name>N</name>
                  <description>Negative condition code flag</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
               </field>
            </fields>
         </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
